In [1]:
import pandas as pd
from pandas import Series
pd.__version__

'1.3.1'

# Series

In [2]:
Obj = Series([67, 78, -31, 72])
Obj

0    67
1    78
2   -31
3    72
dtype: int64

In [3]:
Obj.values

array([ 67,  78, -31,  72], dtype=int64)

In [4]:
Obj.index

RangeIndex(start=0, stop=4, step=1)

In [5]:
Obj2 = Series([67,78,-11,-21], index = ['a','b','c','d'])

In [6]:
Obj2

a    67
b    78
c   -11
d   -21
dtype: int64

In [7]:
Obj2.index

Index(['a', 'b', 'c', 'd'], dtype='object')

In [8]:
Obj2[Obj2 > 3][Obj2 < 77]

a    67
dtype: int64

In [9]:
Obj2['b']

78

In [10]:
'd' in Obj2

True

In [11]:
dict = {'Labuta':1000, 'Juvenil':220, 'Vaaai:':130, 'Vasco':-2}

In [12]:
Obj3=Series(dict)
Obj3

Labuta     1000
Juvenil     220
Vaaai:      130
Vasco        -2
dtype: int64

In [13]:
tasks = ['Labuta','Juvenil','Vasco','Campeao']
Obj4 = Series(dict, index=tasks)
Obj4

Labuta     1000.0
Juvenil     220.0
Vasco        -2.0
Campeao       NaN
dtype: float64

In [14]:
pd.isnull(Obj4)

Labuta     False
Juvenil    False
Vasco      False
Campeao     True
dtype: bool

In [15]:
pd.notnull(Obj4)

Labuta      True
Juvenil     True
Vasco       True
Campeao    False
dtype: bool

In [16]:
Obj4.isnull()

Labuta     False
Juvenil    False
Vasco      False
Campeao     True
dtype: bool

In [17]:
Obj3+Obj4

Campeao       NaN
Juvenil     440.0
Labuta     2000.0
Vaaai:        NaN
Vasco        -4.0
dtype: float64

In [18]:
Obj4.name='Sonho'
Obj4.index.name='Gigante da Colina'
Obj4

Gigante da Colina
Labuta     1000.0
Juvenil     220.0
Vasco        -2.0
Campeao       NaN
Name: Sonho, dtype: float64

# Dataframes

In [19]:
from pandas import DataFrame as df

In [20]:
data = {'Estado': ['Santa Catarina', 'Paraná', 'Goiás', 'Bahia', 'Minas Gerais'], 
        'Ano': [2002, 2003, 2004, 2005, 2006], 
        'População': [1.5, 1.7, 3.6, 2.4, 2.9]}

In [21]:
frame = df(data)
frame

           Estado   Ano  População
0  Santa Catarina  2002        1.5
1          Paraná  2003        1.7
2           Goiás  2004        3.6
3           Bahia  2005        2.4
4    Minas Gerais  2006        2.9

In [22]:
type(frame)

pandas.core.frame.DataFrame

In [24]:
df(data, columns = ['Ano','Estado','População'])

    Ano          Estado  População
0  2002  Santa Catarina        1.5
1  2003          Paraná        1.7
2  2004           Goiás        3.6
3  2005           Bahia        2.4
4  2006    Minas Gerais        2.9

In [25]:
frame2=df(data, columns = ['Ano', 'Estado', 'População', 'Débito'], 
                   index = ['um', 'dois', 'três', 'quatro', 'cinco'])
frame2

         Ano          Estado  População Débito
um      2002  Santa Catarina        1.5    NaN
dois    2003          Paraná        1.7    NaN
três    2004           Goiás        3.6    NaN
quatro  2005           Bahia        2.4    NaN
cinco   2006    Minas Gerais        2.9    NaN

In [26]:
frame2['Estado']

um        Santa Catarina
dois              Paraná
três               Goiás
quatro             Bahia
cinco       Minas Gerais
Name: Estado, dtype: object

In [27]:
frame2.index

Index(['um', 'dois', 'três', 'quatro', 'cinco'], dtype='object')

In [28]:
frame2.columns

Index(['Ano', 'Estado', 'População', 'Débito'], dtype='object')

In [29]:
frame2.dtypes

Ano            int64
Estado        object
População    float64
Débito        object
dtype: object

In [30]:
frame2['Ano']

um        2002
dois      2003
três      2004
quatro    2005
cinco     2006
Name: Ano, dtype: int64

In [35]:
frame2.Estado

um        Santa Catarina
dois              Paraná
três               Goiás
quatro             Bahia
cinco       Minas Gerais
Name: Estado, dtype: object

In [32]:
frame2[:2]

       Ano          Estado  População Débito
um    2002  Santa Catarina        1.5    NaN
dois  2003          Paraná        1.7    NaN